app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY (case when messages.ancestry is null then 0 else 1 end), messages.ancestry, created_at
---
  def index
    @messages = Message.scoped
    @message = Message.new
    first_m = @messages.first

SELECT "messages".* FROM "messages" WHERE (messages.id = 10 or messages.ancestry like '10/%' or messages.ancestry = '10') ORDER BY (case when messages.ancestry is null then 0 else 1 end), messages.ancestry, created_at
UPDATE "messages" SET "x" = 0, "y" = 0, "updated_at" = '2011-04-25 08:37:53.344926' WHERE "messages"."id" = 19
---
  def show
    @message = Message.find(params[:id])

   # y=Message.depth
   # x=Message.depth
   # @message.x= x
   # @message.y= y #@message.depth

    @message.save

INSERT INTO "messages" ("content", "created_at", "updated_at", "ancestry", "x", "y", "ab_x") VALUES ('there was a little bunny', '2011-04-26 16:06:28.224278', '2011-04-26 16:06:28.224278', '23', NULL, NULL, NULL)
---
  def create
    @message = Message.new(params[:message])
    if @message.save

SELECT "messages".* FROM "messages" WHERE (ancestry like '1/%' or ancestry = '1')
DELETE FROM "messages" WHERE "messages"."id" = 2
---
  def destroy
    @message = Message.find(params[:id])
    @message.destroy